In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\Croma Campus\Downloads\Churn_Modelling.csv")

In [3]:
df.shape

(10000, 14)

In [4]:
df.head(4)

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited
0,1,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,2,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,3,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,4,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0

In [5]:
df.Geography.unique()

array(['France', 'Spain', 'Germany'], dtype=object)

In [7]:
df.Exited

0       1
1       0
2       1
3       0
4       0
       ..
9995    0
9996    0
9997    1
9998    1
9999    0
Name: Exited, Length: 10000, dtype: int64

In [13]:
df.groupby('Gender').agg({'Exited':'count'})

        Exited
Gender
Female    4543
Male      5457

In [14]:
df.groupby('Gender').agg({'Exited':'sum'})

        Exited
Gender
Female    1139
Male       898

In [15]:
df.groupby('Geography').agg({'Exited':'count'})

           Exited
Geography
France       5014
Germany      2509
Spain        2477

In [16]:
df.groupby('Geography').agg({'Exited':'sum'})

           Exited
Geography
France        810
Germany       814
Spain         413